---
title: SteelElementFailures
classe: Autodesk.Revit.DB.BuiltInFailures+SteelElementFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# SteelElementFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId SteelElementModifyParametersTaskNotFinished { get; }` | `SteelElementFailures.SteelElementModifyParametersTaskNotFinished` | FailureDefinitionId |
| `FailureDefinitionId SteelElementModifyRangesTaskNotFinished { get; }` | `SteelElementFailures.SteelElementModifyRangesTaskNotFinished` | FailureDefinitionId |
| `FailureDefinitionId SteelElementPreviewTaskNotFinished { get; }` | `SteelElementFailures.SteelElementPreviewTaskNotFinished` | FailureDefinitionId |
| `FailureDefinitionId SteelElementPropagationTaskNotFinished { get; }` | `SteelElementFailures.SteelElementPropagationTaskNotFinished` | FailureDefinitionId |
| `FailureDefinitionId SteelElementTaskNotFinished { get; }` | `SteelElementFailures.SteelElementTaskNotFinished` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```